Catalogs/ВАТСКонстанты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ВАТСКонстанты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.МобилонОтветственныйЗаПропущенный</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/МобилонОтветственныйЗаПропущенный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>МобилонОтветственныйЗаПропущенный</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Последний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВАТСКонстанты/Ext/ManagerModule.bsl
Функция ПолучитьЗначение(Код) Экспорт 

	Возврат Справочники.ВАТСКонстанты.НайтиПоКоду(Код).Значение; 		

КонецФункции


Процедура СоздатьПредопределенныеЭлементы() Экспорт 
	Наим = "API-токен ВАТС"; 
	Код = "APIтокен";
	Если Справочники.ВАТСКонстанты.НайтиПоКоду(Код) = Справочники.ВАТСКонстанты.ПустаяСсылка() Тогда
		НовыйЭлемент = Справочники.ВАТСКонстанты.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наим;
		НовыйЭлемент.Код = Код;
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Наим = "Ответственный за пропущенный"; 
	Код = "ОтветственныйЗаПропущенный";
	Если Справочники.ВАТСКонстанты.НайтиПоКоду(Код) = Справочники.ВАТСКонстанты.ПустаяСсылка() Тогда
		НовыйЭлемент = Справочники.ВАТСКонстанты.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наим;
		НовыйЭлемент.Код = Код;
		НовыйЭлемент.Значение = Перечисления.МобилонОтветственныйЗаПропущенный.Последний;
		НовыйЭлемент.Записать();
	КонецЕсли;
	
КонецПроцедуры
